package by.kizin.konstantin.resttask.service.client;

public class Main {


    public static void main(String[] args) {

        /*
        * 1)Создать массивы , состоящие из 5 элементов каждый, всех известных тебе типов(int,float,double,char,string).
        *
        * 2)Создать на каждый тип даннх метод, который принимает массив и печатает каждый элелемент этого массива.
        *
        * 3) Создать цикл, печатает цыфры от 0 до 1_000_000.
        *
        *
        *
        * */



        String helloWorld = "hellohe";

        char c = helloWorld.charAt(4);

        String concat = helloWorld.concat(" Jsadasdasd");

        boolean aaaa = helloWorld.equals("Hello");

        String s = helloWorld.toLowerCase();


        helloWorld.isEmpty();

        helloWorld.startsWith("h");

        String s1 = helloWorld.replaceFirst("he", "eh");

        System.out.println(s1);


        System.out.println(aaaa);






    }




}
